[
{"id": [0], "pregunta": ["Problema para sumar dias en intervalos SQL SERVER"], "descripcion": ["\r\n            tengo un inconveniente con una consulta en SQL\nCree una query que me trae en formato de 15 minutos las llamadas de un sistema,\nel problema es que cuando pongo mas de 1 dia me agrega otra fila.\n por ...\r\n        "]},
{"id": [1], "pregunta": ["fallo en el menu"], "descripcion": ["\r\n            tengo este programa (está sin terminar), pero tengo un problema, ya que a la hora de anyadir la funcion definida listarEstados() me falla el programa (dentro del menú opción 1). ¿Alguna solución?\n\n...\r\n        "]},
{"id": [2], "pregunta": ["Problema con el control de errores de un script Batch"], "descripcion": ["\r\n            Hola buenas profesionales.\n\nEstoy realizando un ejercicio para clases de SIINF y me he encontrado un problema con el control de errores.\n\nLas directrices a seguir son: \r\n1er argumento: Número entero ...\r\n        "]},
{"id": [3], "pregunta": ["¿Por qué AJAX se ejecuta hasta el 2do click y no en el 1ro?"], "descripcion": ["\r\n            Tengo una función en js que utiliza AJAX para subir un archivo, si no he seleccionado ningún archivo y hago el click al botón subir la acción del js se ejecuta sin problemas (muestra un alert si no se ...\r\n        "]},
{"id": [4], "pregunta": ["¿como solucionar el error IQueryable doesn't implement IAsyncQueryProvider?"], "descripcion": ["\r\n            como puedo paginar un listado de registros que viene de mongodb, implemente un paginador usando asp.net core , blazor y entity freamwork, ya funciona usando dbset y registros de sql intento usarlo de ...\r\n        "]},
{"id": [5], "pregunta": ["Grids anidados con react-bootstrap?"], "descripcion": ["\r\n            Estoy renderizando una view para mostrar productos, estoy tratando de acomodar unas cards dentro de un row pero no consigo el resultado deseado.Creo estar equivocado en la forma que los aprendi a usar ...\r\n        "]},
{"id": [6], "pregunta": ["Agrupar una lista de objetos dentro de otra lista"], "descripcion": ["\r\n            ¿ me podrian ayudar a lo siguiente?:\n\nTengo una Lista de objetos.y dentro de mi lista tengo otro objeto con listas quisiera saber la manera de poder agrupar es decir:\n\nTengo mi clase principal que es ...\r\n        "]},
{"id": [7], "pregunta": ["Fallo en Buildozer"], "descripcion": ["\r\n            Con el código para una sencilla aplicación en mano, me disponía a utilizar buildozer para poder ejecutarlo desde mi móvil.\nComo el log es demasiado largo no me permite introducirlo aquí enteramente, ...\r\n        "]},
{"id": [8], "pregunta": ["Web Scraping Python, Extraer contenido de script"], "descripcion": ["\r\n            Tengo un problema con este pequeño codigo, Estoy intentando extraer lo que se encuentra dentro de aquel script, Pero no se me ocurre una forma de declarar la busqueda. Dejo el código.\n\nfrom bs4 import ...\r\n        "]},
{"id": [9], "pregunta": ["Espacio en blanco al ocultar en el movil"], "descripcion": ["\r\n            Al ocultar una Smart Slider en el movil, me sigue dejando un espacio en blanco en el sitio en el que estaba, aunque en el ordenador este espacio no me sale. Solamente añadí esto: \n\n@media only screen ...\r\n        "]},
{"id": [10], "pregunta": ["Aplicación en Rails 5 con Bootstrap 4 no se adapta a dispositivos móvil"], "descripcion": ["\r\n            No tengo mucha experiencia con ROR (Rubt-On-Rails), estoy creando una aplicación sencilla por los momentos e implemente Bootstrap 4, realice la instalación como la vi en esta Guía, Todo funciona bien! ...\r\n        "]},
{"id": [11], "pregunta": ["Importar un fichero que se encuentra en Vendor, Laravel 7"], "descripcion": ["\r\n            he instalado lo siguiente en laravel, este archivo contiene funciones, mi duda es como utilizar estas funciones en el web.php o en un controlador. \r\nHe probado lo siguiente en el web.php y me da este ...\r\n        "]},
{"id": [12], "pregunta": ["Agregar imagen de fondo a un JFrame"], "descripcion": ["\r\n            ¿Cómo puedo agregar una imagen de fondo a un JFrame en Java Swing?\n\nCódigo:\n\nimport java.awt.Graphics;\nimport java.awt.Image;\nimport java.net.URL;\nimport javax.swing.ImageIcon;\nimport javax.swing....\r\n        "]},
{"id": [13], "pregunta": ["al instalar el apk de mi app ionic en mi smartphone no funciona completa"], "descripcion": ["\r\n            necesito ayuda con mi app de ionic, ya que al ejecutar \"ionic cordova build android\" e instalar el apk generado en mi smartphone solo funciona a medias, algunos elementos no aparecen, a pesar de que ...\r\n        "]},
{"id": [14], "pregunta": ["llamado Servicio API solo funciona una vez , segunda llamada del servicio da error 1001 - usando AlamoFire en SWIFT"], "descripcion": ["\r\n            programando en Xcode una aplicacion que llama unos servicios nuevos. El llamado de otros servicios funcionan normalmente pero el llamado de otros Servicio Rest de otro servidor  solo funciona una vez ...\r\n        "]},
{"id": [15], "pregunta": ["Error al migrar solucion de visual studio 2015 a visual studio 2017"], "descripcion": ["\r\n            No se si alguien le ha ocurrido el problema en donde se tenia un proyecto en visual studio 2015 peor por x o y razón se tuvo que cambiar de equipo e instalar la versión de visual studio 2017 cuando ...\r\n        "]},
{"id": [16], "pregunta": ["Cómo desarrollar un producto “Build a Box” en Shopify"], "descripcion": ["\r\n            sucede que que estoy intentando agregar una caja de Macarrones en mi sitio web de Shopify y no encuentro solución, no hay una app que haga esto.\n\nNecesito hacer algo como esta página https://www....\r\n        "]},
{"id": [17], "pregunta": ["Problemas con el carousel de materialize"], "descripcion": ["\r\n            Hola que tal tengo un problema con el carousel de materialize ,\nel caso es el siguiente tengo un carousel que debajo esta el navbar, el carousel solo muestra la mitad o solo una parte de la imagen tal ...\r\n        "]},
{"id": [18], "pregunta": ["¿Como puedo crear una pausa del programa en Javascript?"], "descripcion": ["\r\n            Quiero hacer una función que cuando se ejecute las acciones tengan una pausa como de tres segundos entre si por si no me entieden he intentado esto:\n\n  function allplay(){\n           word.play();\n     ...\r\n        "]},
{"id": [19], "pregunta": ["necesito llenar un select con los campos de otra tabla"], "descripcion": ["\r\n            ya que es MVC no se como realizarla\r\n        "]},
{"id": [20], "pregunta": ["Manejo de LinkedList"], "descripcion": ["\r\n            Estoy haciendo una clase que simule las LinkedList de java, debido a que el manejo de estas es diferente a los arrays me encuentro atascado con un par de métodos.\nEn el código que dejo a continuación ...\r\n        "]},
{"id": [21], "pregunta": ["Me salta un error IndentationError: expected an indented block"], "descripcion": ["\r\n            Soy nuevo en python y estaba intentado crear un programa que con dos numeros que ingreso me diga si los valores son iguales o no pero me salta ese error al ejecutar el programa. \n\ndef validar_numeros(...\r\n        "]},
{"id": [22], "pregunta": ["Mi input tipo time no se llena automáticamente con php"], "descripcion": ["\r\n            estoy intentando llenar un input tipo time con la hora actual de esta manera:\n\n<?php \nini_set('date.timezone','America/Bogota');\n\n$hora=date(\"g:i A\");\n?>\r\nY de esta forma estoy llenando el input ...\r\n        "]},
{"id": [23], "pregunta": ["Como renderizar una constante?"], "descripcion": ["\r\n            puedo renderizar una constante?\n\nconst myTitle = <h1>hello world</h1>;\n\nclass TodoApp extends Component {\n  render() {\n\n    return (myTitle)\n  }\n}\r\nquiero renderizar esta constante myTitle\n...\r\n        "]},
{"id": [24], "pregunta": ["¿Cómo mostrar datos recogidos en formulario - JSON?"], "descripcion": ["\r\n            Necesito ayuda con el tema siguiente, se pide:\r\nSolicitar al usuario datos sobre un coche (marca, modelo, motor, potencia y precio). \nAñadir dos botones, uno Parsear y otro Mostrar. El primero leerá ...\r\n        "]},
{"id": [25], "pregunta": ["Login con reactJs y Redux"], "descripcion": ["\r\n            Estoy hace unos días intentando realizar un login con reactJs y Redux. \n\nTengo una API en Laravel que procesa email y contraseña y devuelve un token, asique por el lado backend no hay problema.\n\nEn ...\r\n        "]},
{"id": [26], "pregunta": ["¿Porque mi while no me funciona?"], "descripcion": ["\r\n            quiero hacer una barra de progreso y no funciona con el bucle while pero no se por que, ¿alguien me ayuda?\n\ntry {\n            int x=0; int y=100;\n                while(x<=y) {\n                    ...\r\n        "]},
{"id": [27], "pregunta": ["Python # Simular clicks mouse unidad virtual"], "descripcion": ["\r\n            Estoy queriendo mediante Telegram (modulo telepot) simular clicks de mouse para abrir una apliacion, en una unidad virtual con windows 7. Todo funciona como quisiera mientras yo este dentro d la ...\r\n        "]},
{"id": [28], "pregunta": ["Como evitar el for en R para recorrer las variables de un dataframe"], "descripcion": ["\r\n            En un dataframe quiero añadir una nueva variable y los valores calcularlos aplicando una función a la que le paso como parametro el valor de una de las variables ya existentes\n\nEs decir, parto de este ...\r\n        "]},
{"id": [29], "pregunta": ["Es posible ver que privilegios tienen SYSDBA y SYSOPER desde el diccionario de Datos?"], "descripcion": ["\r\n            Por lo que leí en la documentación, SYSDBA y SYSOPER son tratados como \"roles\" pero al consultar DBA_ROLES no aparecen, existe alguna vista que me permite ver que contienen?\r\n        "]},
{"id": [30], "pregunta": ["Por qué este Migrate en servidor Laravel con Artisan no funciona?"], "descripcion": ["\r\n            tengo una API-REST con Laravel funcionando correctamente en local, funcionan las migraciones y todo. Estoy usando amazon Elastic Beanstalk para alojarla en un servidor, he añadido los RDS_* en el ...\r\n        "]},
{"id": [31], "pregunta": ["Ocultar las ramas mergeadas y cerradas de Git en Sourcetree"], "descripcion": ["\r\n            Recientemente hice una migración de Mercurial a Git en Bitbucket, sin problemas, y continué trabajando como hacía con Sourcetree (no me siento cómoda trabajando con consola, lo siento). Y me encuentro ...\r\n        "]},
{"id": [32], "pregunta": ["Formatear fecha en Javascript menor a 1970"], "descripcion": ["\r\n            Tengo una fecha menor a 1970, en este caso 06/10/1943, y la mando desde ASP.NET a Javascript por AJAX, y esta llega con el formato /Date(-828046800000)/. En JS tengo una funcion para transformar estos ...\r\n        "]},
{"id": [33], "pregunta": ["net::ERR_CONNECTION_REFUSED en Apache, Angular, Node API Rest"], "descripcion": ["\r\n            Estoy trabajando en un proyecto desarrollado en Angular con conexión a una API Rest hecha en Node, Express y Typescript.\n\nHe desplegado la App en un servidor Apache 2.4.29 en una instancia (máquina ...\r\n        "]},
{"id": [34], "pregunta": ["me da resultado NaN cuando sumo dos cajas de texto en asp.net"], "descripcion": ["\r\n            buen día, tengo que sumar dos cajas de texto y que la tercera de el resultado final. \n\nla primer caja de texto graba también su valor en la del resultado, es aquí cuando resultado pasa a ser NaN, ...\r\n        "]},
{"id": [35], "pregunta": ["Docker compose no crea la carpeta src para laravel"], "descripcion": ["\r\n            Cordial saludo, al realizar un docker-compose de laravel no puedo ingresar por bash a la carpeta src. en consola docker arroja este error \n\nWarning: DocumentRoot [/var/www/html/src/\r\n        "]},
{"id": [36], "pregunta": ["python - tkinter , sistema de ventas"], "descripcion": ["\r\n            Estoy haciendo un sistema de ventas , dejo aca las dos funciones , la primera es para agregar la venta que se ingresa a una tabla y la otra es para generar la venta en la base de datos , estoy muy ...\r\n        "]},
{"id": [37], "pregunta": ["Exportar conversaciones de whatsapp a formato plato .txt"], "descripcion": ["\r\n            Necesito exportar mis conversaciones de whatsapp ha un formato en el cual pueda hacer analítica de datos\n\nActualmente el proceso que uso es \n*\r\nPara enviar tu historial de chats por correo electrónico,...\r\n        "]},
{"id": [38], "pregunta": ["Describe-snapshots menor a 7 días de creación"], "descripcion": ["\r\n            Estoy intentando obtener las snapshots creadas en los últimos 7 días para poder almacenarlas y luego realizar distintos tipos de análisis.\n\nEstoy utilizando el siguiente script:\n\naws ec2 describe-...\r\n        "]},
{"id": [39], "pregunta": ["Cambie de pagina en mi DNS"], "descripcion": ["\r\n            Anteriormente tenia una web en Shopify asociada a un DNS de GODADDY.\nLuego elimine la pagina de shopify y la asociacion con el DNS de GODADDY, y asocie una web en prestashop con el DNS DE GODADDY.\n\n...\r\n        "]},
{"id": [40], "pregunta": ["recorrer objeto bidimensional con vuejs"], "descripcion": ["\r\n            estoy intentando traer los datos de un array de post  los cuales vienen con sus respectivos comentarios, pero no logro acceder a los comentarios a traves de vuejs. con laravel simplemente hacia un ...\r\n        "]},
{"id": [41], "pregunta": ["Como conectar mi aplicacion JavaFx Scene Builder con base de datos MySQL?"], "descripcion": ["\r\n            Estoy haciendo una aplicacion en Java y para crear la interfaz grafica he empleado Scene Builder. \r\nMi aplicacion almacena empleados. Los botones nuevo, editar y borrar hacen su funcion. Pero guardan ...\r\n        "]},
{"id": [42], "pregunta": ["Como puedo añadir datos a un fichero de objetos binario sin sobreescribir los datos"], "descripcion": ["\r\n            como puedo mantener los objetos introducidos en un fichero binario de objetos?\nAlguien me puede ayudar en esto , Estoy un poco desesperado , ya que llevo bastante en esto\n\n  Scanner input=new Scanner(...\r\n        "]},
{"id": [43], "pregunta": ["Leaflet - ¿Cómo sacar la información de una capa de mi mapa?"], "descripcion": ["\r\n            Cuando se clica el mapa, aparece un \"pop-up\" mostrando un código de referencia. Este código lo obtiene de source.getLayer. Este código es único para cada área de tierra, que pertenece a algún ...\r\n        "]},
{"id": [44], "pregunta": ["Activar campos automaticamente ante un error en el login"], "descripcion": ["\r\n            tengo un pequeño login, usuario y contraseña. Cuando hay un error en el login, eje: contraseña incorrecta, el login se habilita con un click en los campos. Con qué propiedad, atributo, funcionalidad, ...\r\n        "]},
{"id": [45], "pregunta": ["Error al integrar SDK de MercadoPago en React"], "descripcion": ["\r\n            Estoy siguiendo los pasos de la documentación de MP pero al hacer click en el boton de Comprar, se abre el Modal de MP y dice \"Oh, no, algo anduvo mal.\", y en la consola recibo el siguiente error:\n\n[...\r\n        "]},
{"id": [46], "pregunta": ["Problemas con el socket de cloud_firestore"], "descripcion": ["\r\n            Estoy desarrollando una app en flutter que carga un mapa (de Gloogle) y en el agrego varios marcadores.\n\nLa posición de los marcadores los  guardo en firebase y uso cloud_firestore para hacer ...\r\n        "]},
{"id": [47], "pregunta": ["¿Cómo sé qué fuentes tiene un sistema y las importo o no a la hora de cargar una página?"], "descripcion": ["\r\n            Al hilo de ¿Cómo defino el tipo de letra que se ve en toda la página con Bootstrap? aprendí que hay fuentes que vienen de serie y otras que no, pero que esto depende del sistema ...\r\n        "]},
{"id": [48], "pregunta": ["Máscara a inputs generados de manera dinámica en php"], "descripcion": ["\r\n            Tengo la siguiente función\n\n\r\n\r\n$(\"#price\").on({\r\n  \"focus\": function(event) {\r\n    $(event.target).select();\r\n  },\r\n  \"keyup\": function(event) {\r\n    $(event.target).val(function(index, value) {\r\n    ...\r\n        "]},
{"id": [49], "pregunta": ["Problema con lectura de Firestore Database"], "descripcion": ["\r\n            el código que les copio a continuación lo tengo implementado dentro de un ViewModel.\n\n private void PopulateList() {\n      _db = FirebaseFirestore.getInstance();\n      storeRoomArrayList = new ...\r\n        "]}
]